# Agenda for today

## First, the debugger

In [1]:
def mysum(*numbers):
    total = 0
    for one_number in numbers:
        total += one_number
    return total

In [2]:

mysum(10, 20, 30)

60

In [3]:
mysum(100, 200, 300)

600

In [5]:
mysum([10, 20, 30])

TypeError: unsupported operand type(s) for +=: 'int' and 'list'

## Next, serious stuff

### Serious 1

### Serious 2

### Serious 3

# Final stuff

Hello!

# Actual agenda

1. Multi-indexing
2. Sorting
3. Grouping
4. Pivot tables

Download the data files from here:

https://files.lerner.co.il/pandas-workout-data.zip

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
import numpy as np

In [9]:
df = DataFrame(np.random.randint(0, 1000, [4, 5]),
               index=list('abcd'),
               columns=list('vwxyz'))

In [10]:
df

     v    w    x    y    z
a   40  128  238  840  321
b  288  748  292  867  939
c  917  942  832  391  657
d  945  345  211  343  525

In [12]:
# reset_index -- turns the index into a regular column

df = df.reset_index()
df

  index    v    w    x    y    z
0     a   40  128  238  840  321
1     b  288  748  292  867  939
2     c  917  942  832  391  657
3     d  945  345  211  343  525

In [15]:
df.columns = list('uvwxyz')

In [16]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [17]:
help(df.reset_index)

Help on method reset_index in module pandas.core.frame:

reset_index(level: 'IndexLabel' = None, *, drop: 'bool' = False, inplace: 'bool' = False, col_level: 'Hashable' = 0, col_fill: 'Hashable' = '', allow_duplicates: 'bool | lib.NoDefault' = <no_default>, names: 'Hashable | Sequence[Hashable]' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Reset the index, or a level of it.

    Reset the index of the DataFrame, and use the default one instead.
    If the DataFrame has a MultiIndex, this method can remove one or more
    levels.

    Parameters
    ----------
    level : int, str, tuple, or list, default None
        Only remove the given levels from the index. Removes all levels by
        default.
    drop : bool, default False
        Do not try to insert index into dataframe columns. This resets
        the index to the default integer index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    col_level : int or str, default 0
        If the columns have multiple levels, determines which level the
        labels are inserted into. By default it is inserted into the first
        level.
    col_fill : object, default ''
        If the columns have multiple levels, determines how the other
        levels are named. If None then the index name is repeated.
    allow_duplicates : bool, optional, default lib.no_default
        Allow duplicate column labels to be created.

        .. versionadded:: 1.5.0

    names : int, str or 1-dimensional list, default None
        Using the given string, rename the DataFrame column which contains the
        index data. If the DataFrame has a MultiIndex, this has to be a list or
        tuple with length equal to the number of levels.

        .. versionadded:: 1.5.0

    Returns
    -------
    DataFrame or None
        DataFrame with the new index or None if ``inplace=True``.

    See Also
    --------
    DataFrame.set_index : Opposite of reset_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([('bird', 389.0),
    ...                    ('bird', 24.0),
    ...                    ('mammal', 80.5),
    ...                    ('mammal', np.nan)],
    ...                   index=['falcon', 'parrot', 'lion', 'monkey'],
    ...                   columns=('class', 'max_speed'))
    >>> df
             class  max_speed
    falcon    bird      389.0
    parrot    bird       24.0
    lion    mammal       80.5
    monkey  mammal        NaN

    When we reset the index, the old index is added as a column, and a
    new sequential index is used:

    >>> df.reset_index()
        index   class  max_speed
    0  falcon    bird      389.0
    1  parrot    bird       24.0
    2    lion  mammal       80.5
    3  monkey  mammal        NaN

    We can use the `drop` parameter to avoid the old index being added as
    a column:

    >>> df.reset_index(drop=True)
        class  max_speed
    0    bird      389.0
    1    bird       24.0
    2  mammal       80.5
    3  mammal        NaN

    You can also use `reset_index` with `MultiIndex`.

    >>> index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
    ...                                    ('bird', 'parrot'),
    ...                                    ('mammal', 'lion'),
    ...                                    ('mammal', 'monkey')],
    ...                                   names=['class', 'name'])
    >>> columns = pd.MultiIndex.from_tuples([('speed', 'max'),
    ...                                      ('species', 'type')])
    >>> df = pd.DataFrame([(389.0, 'fly'),
    ...                    (24.0, 'fly'),
    ...                    (80.5, 'run'),
    ...                    (np.nan, 'jump')],
    ...                   index=index,
    ...                   columns=columns)
    >>> df
                   speed species
                     max    type
    class  name
    bird   falcon  389.0     fly
           parrot   24.0     fly
    mammal lion     80.5     run
           monkey    NaN    jump

    Using the `names` parameter, choose a name for the index column:

    >>> df.reset_index(names=['classes', 'names'])
      classes   names  speed species
                         max    type
    0    bird  falcon  389.0     fly
    1    bird  parrot   24.0     fly
    2  mammal    lion   80.5     run
    3  mammal  monkey    NaN    jump

    If the index has multiple levels, we can reset a subset of them:

    >>> df.reset_index(level='class')
             class  speed species
                      max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    If we are not dropping the index, by default, it is placed in the top
    level. We can place it in another level:

    >>> df.reset_index(level='class', col_level=1)
                    speed species
             class    max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    When the index is inserted under another level, we can specify under
    which one with the parameter `col_fill`:

    >>> df.reset_index(level='class', col_level=1, col_fill='species')
                  species  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

    If we specify a nonexistent level for `col_fill`, it is created:

    >>> df.reset_index(level='class', col_level=1, col_fill='genus')
                    genus  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

In [18]:
df.index = range(1, len(df.index)+1)

In [19]:

df

   u    v    w    x    y    z
1  a   40  128  238  840  321
2  b  288  748  292  867  939
3  c  917  942  832  391  657
4  d  945  345  211  343  525

In [20]:
df.index

RangeIndex(start=1, stop=5, step=1)

In [21]:
# make v the index

df.set_index('v')

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [22]:
df = df.set_index('v')

In [23]:
df

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [24]:
df['v']

KeyError: 'v'

In [25]:
%xmode Minimal

Exception reporting mode: Minimal

In [26]:
df.index

Index([40, 288, 917, 945], dtype='int64', name='v')

In [27]:
df = df.reset_index()

In [28]:
df

     v  u    w    x    y    z
0   40  a  128  238  840  321
1  288  b  748  292  867  939
2  917  c  942  832  391  657
3  945  d  345  211  343  525

In [31]:
# get them in the "right" order
df = df[['u', 'v', 'w', 'x', 'y', 'z']]
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [32]:
# what happens if I set an index with more than one item?

df.set_index(['u', 'y'])

         v    w    x    z
u y
a 840   40  128  238  321
b 867  288  748  292  939
c 391  917  942  832  657
d 343  945  345  211  525

In [33]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [35]:
df['u'] = list('abab')
df['v'] = [10, 20, 30, 10]

In [37]:
df = df.set_index(['u', 'v'])
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [38]:
df.loc['a']

      w    x    y    z
v
10  128  238  840  321
30  942  832  391  657

In [39]:
df.loc[('a', 10)]

w    128
x    238
y    840
z    321
Name: (a, 10), dtype: int64

In [40]:
df.loc[['a', 10]]

KeyError: '[10] not in index'

In [41]:
df.loc[(:, 10)]

SyntaxError: invalid syntax (1953882588.py, line 1)

In [42]:
df.xs(10, level=1)

     w    x    y    z
u
a  128  238  840  321
b  345  211  343  525

In [43]:
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [44]:
help(df.set_index)

Help on method set_index in module pandas.core.frame:

set_index(keys, *, drop: 'bool' = True, append: 'bool' = False, inplace: 'bool' = False, verify_integrity: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Set the DataFrame index using existing columns.

    Set the DataFrame index (row labels) using one or more existing
    columns or arrays (of the correct length). The index can replace the
    existing index or expand on it.

    Parameters
    ----------
    keys : label or array-like or list of labels/arrays
        This parameter can be either a single column key, a single array of
        the same length as the calling DataFrame, or a list containing an
        arbitrary combination of column keys and arrays. Here, "array"
        encompasses :class:`Series`, :class:`Index`, ``np.ndarray``, and
        instances of :class:`~collections.abc.Iterator`.
    drop : bool, default True
        Delete columns to be used as the new index.
    append : bool, default False
        Whether to append columns to existing index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    verify_integrity : bool, default False
        Check the new index for duplicates. Otherwise defer the check until
        necessary. Setting to False will improve the performance of this
        method.

    Returns
    -------
    DataFrame or None
        Changed row labels or None if ``inplace=True``.

    See Also
    --------
    DataFrame.reset_index : Opposite of set_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame({'month': [1, 4, 7, 10],
    ...                    'year': [2012, 2014, 2013, 2014],
    ...                    'sale': [55, 40, 84, 31]})
    >>> df
       month  year  sale
    0      1  2012    55
    1      4  2014    40
    2      7  2013    84
    3     10  2014    31

    Set the index to become the 'month' column:

    >>> df.set_index('month')
           year  sale
    month
    1      2012    55
    4      2014    40
    7      2013    84
    10     2014    31

    Create a MultiIndex using columns 'year' and 'month':

    >>> df.set_index(['year', 'month'])
                sale
    year  month
    2012  1     55
    2014  4     40
    2013  7     84
    2014  10    31

    Create a MultiIndex using an Index and a column:

    >>> df.set_index([pd.Index([1, 2, 3, 4]), 'year'])
             month  sale
       year
    1  2012  1      55
    2  2014  4      40
    3  2013  7      84
    4  2014  10     31

    Create a MultiIndex using two Series:

    >>> s = pd.Series([1, 2, 3, 4])
    >>> df.set_index([s, s**2])
          month  year  sale
    1 1       1  2012    55
    2 4       4  2014    40
    3 9       7  2013    84
    4 16     10  2014    31

In [45]:
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [49]:
df = pd.read_csv('taxi.csv',
                 usecols=['passenger_count', 'VendorID',
                         'trip_distance', 'total_amount'],
                index_col=['VendorID','passenger_count'])
df

                          trip_distance  total_amount
VendorID passenger_count
2        1                         1.63         17.80
         1                         0.46          8.30
         1                         0.87         11.00
         1                         2.13         17.16
1        1                         1.40         10.30
...                                 ...           ...
         1                         2.70         12.30
         1                         4.50         20.30
2        1                         5.59         22.30
         6                         1.54          7.80
1        1                         5.80         26.75

[9999 rows x 2 columns]

In [50]:
df.loc[2]

                 trip_distance  total_amount
passenger_count
1                         1.63         17.80
1                         0.46          8.30
1                         0.87         11.00
1                         2.13         17.16
1                         1.27         15.80
...                        ...           ...
1                         6.07         26.62
1                         1.48          9.30
1                         6.37         23.30
1                         5.59         22.30
6                         1.54          7.80

[5166 rows x 2 columns]

In [51]:
# vendor 2, 1 passenger

df.loc[(2, 1)]

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75344/1701779935.py:3: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[(2, 1)]

                          trip_distance  total_amount
VendorID passenger_count
2        1                         1.63         17.80
         1                         0.46          8.30
         1                         0.87         11.00
         1                         2.13         17.16
         1                         1.27         15.80
...                                 ...           ...
         1                         5.55         21.35
         1                         6.07         26.62
         1                         1.48          9.30
         1                         6.37         23.30
         1                         5.59         22.30

[3195 rows x 2 columns]

In [52]:
!ls *oly*

2180.42s - pydevd: Sending message related to process being replaced timed-out after 5 seconds
olympic_athlete_events.csv

In [53]:
!head olympic_athlete_events.csv

2216.86s - pydevd: Sending message related to process being replaced timed-out after 5 seconds
"ID","Name","Sex","Age","Height","Weight","Team","NOC","Games","Year","Season","City","Sport","Event","Medal"
"1","A Dijiang","M",24,180,80,"China","CHN","1992 Summer",1992,"Summer","Barcelona","Basketball","Basketball Men's Basketball",NA
"2","A Lamusi","M",23,170,60,"China","CHN","2012 Summer",2012,"Summer","London","Judo","Judo Men's Extra-Lightweight",NA
"3","Gunnar Nielsen Aaby","M",24,NA,NA,"Denmark","DEN","1920 Summer",1920,"Summer","Antwerpen","Football","Football Men's Football",NA
"4","Edgar Lindenau Aabye","M",34,NA,NA,"Denmark/Sweden","DEN","1900 Summer",1900,"Summer","Paris","Tug-Of-War","Tug-Of-War Men's Tug-Of-War","Gold"
"5","Christine Jacoba Aaftink","F",21,185,82,"Netherlands","NED","1988 Winter",1988,"Winter","Calgary","Speed Skating","Speed Skating Women's 500 metres",NA
"5","Christine Jacoba Aaftink","F",21,185,82,"Netherlands","NED","1988 Winter",1988,"Winter","Calgary","Speed Skating","Speed Skating Women's 1,000 metres",NA
"5","Christine Jacoba Aaftink","F",25,185,82,"Netherlands","NED","1992 Winter",1992,"Winter","Albertville","Speed Skating","Speed Skating Women's 500 metres",NA
"5","Christine Jacoba Aaftink","F",25,185,82,"Netherlands","NED","1992 Winter",1992,"Winter","Albertville","Speed Skating","Speed Skating Women's 1,000 metres",NA
"5","Christine Jacoba Aaftink","F",27,185,82,"Netherlands","NED","1994 Winter",1994,"Winter","Lillehammer","Speed Skating","Speed Skating Women's 500 metres",NA

# Exercise: Olympic events

1. Read the file `olympic_athlete_events.csv` into a data frame. We want all of the columns.
2. Make the index Year + Sport + Event.
3. What was the average height for all athletes in 1992?
4. What were the average height and weight for all basketball players?

In [ ]:
df = df.set_index('colname')
df = df.set_index(['col1', 'col2'])

In [4]:
df = pd.read_csv('olympic_athlete_events.csv',
                index_col=['Year', 'Sport', 'Event'])
df.head()

,,,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Year,Sport,Event,,,,,,,,,,,,
1992,Basketball,Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
2012,Judo,Judo Men's Extra-Lightweight,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,Summer,London,NaN
1920,Football,Football Men's Football,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Summer,Antwerpen,NaN
1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Gold
1988,Speed Skating,Speed Skating Women's 500 metres,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Winter,Calgary,NaN

In [5]:
df.loc[1992,  # row selector
'Height' # column selector
].mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75320/1286576537.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[1992,  # row selector

176.17464873848013

In [59]:
df.loc[1992].loc[:, 'Height']

Sport                  Event
Basketball             Basketball Men's Basketball                 180.0
Speed Skating          Speed Skating Women's 500 metres            185.0
                       Speed Skating Women's 1,000 metres          185.0
Cross Country Skiing   Cross Country Skiing Men's 10 kilometres    188.0
                       Cross Country Skiing Men's 50 kilometres    188.0
                                                                   ...
Synchronized Swimming  Synchronized Swimming Women's Duet          167.0
Volleyball             Volleyball Men's Volleyball                 200.0
Athletics              Athletics Women's 800 metres                172.0
Fencing                Fencing Men's epee, Team                    175.0
Rowing                 Rowing Men's Double Sculls                  197.0
Name: Height, Length: 16413, dtype: float64

In [60]:
%timeit df.loc[1992, 'Height'].mean()

<magic-timeit>:1: PerformanceWarning: indexing past lexsort depth may impact performance.

6.76 ms  241 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [61]:
%timeit df.loc[1992].loc[:, 'Height'].mean()

5.49 ms  389 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [63]:
%timeit df.loc[1992]['Height'].mean()

5.28 ms  339 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [64]:
df.loc[(1992,), 'Height'].mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75344/4164985527.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[(1992,), 'Height'].mean()

176.17464873848013

In [66]:
df.loc[(1992, 'Basketball'), 'Height'].mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75344/3365554291.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[(1992, 'Basketball'), 'Height'].mean()

193.12554112554113

In [70]:
# 4. What were the average height and weight for all basketball players?

df.xs('Basketball', level='Sport')[['Height', 'Weight']].mean()

Height    190.869879
Weight     85.777053
dtype: float64

In [72]:
# variation: average height + weight for basketball players in 1992

df.xs((1992, 'Basketball'),
     level=['Year', 'Sport'])

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Event,,,,,,,,,,,,
Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
Basketball Women's Basketball,1020,Adriana Aparecida dos Santos,F,21.0,180.0,61.0,Brazil,BRA,1992 Summer,Summer,Barcelona,NaN
Basketball Women's Basketball,1232,Judith guila Hernndez,F,19.0,192.0,80.0,Cuba,CUB,1992 Summer,Summer,Barcelona,NaN
Basketball Men's Basketball,2256,Vladan Alanovi,M,25.0,190.0,81.0,Croatia,CRO,1992 Summer,Summer,Barcelona,Silver
Basketball Men's Basketball,2424,Santiago Aldama Aleson,M,23.0,213.0,98.0,Spain,ESP,1992 Summer,Summer,Barcelona,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
Basketball Women's Basketball,134417,Zhan Shuping,F,28.0,188.0,79.0,China,CHN,1992 Summer,Summer,Barcelona,Silver
Basketball Men's Basketball,134608,Zhang Yongjun,M,29.0,186.0,85.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
Basketball Women's Basketball,134727,Zheng Dongmei,F,24.0,173.0,60.0,China,CHN,1992 Summer,Summer,Barcelona,Silver
Basketball Women's Basketball,134728,Zheng Haixia,F,25.0,204.0,115.0,China,CHN,1992 Summer,Summer,Barcelona,Silver
Basketball Women's Basketball,134906,Olena Mykolaivna Zhyrko (-Marenchikova),F,24.0,180.0,NaN,Unified Team,EUN,1992 Summer,Summer,Barcelona,Gold

In [75]:
# Get all rows for years 1992-2000,
# in basketball

df.xs((slice(1992,2000), 'Basketball'),
     level=['Year', 'Sport'])

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Event,,,,,,,,,,,,
Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
Basketball Men's Basketball,136,Alessandro Abbio,M,29.0,195.0,85.0,Italy,ITA,2000 Summer,Summer,Sydney,NaN
Basketball Men's Basketball,351,Julius Shareef Abdur-Rahim,M,23.0,202.0,104.0,United States,USA,2000 Summer,Summer,Sydney,Gold
Basketball Women's Basketball,580,Svetlana Olegovna Abrosimova,F,20.0,188.0,77.0,Russia,RUS,2000 Summer,Summer,Sydney,NaN
Basketball Men's Basketball,1000,Dainius Adomaitis,M,26.0,202.0,100.0,Lithuania,LTU,2000 Summer,Summer,Sydney,Bronze
...,...,...,...,...,...,...,...,...,...,...,...,...
Basketball Women's Basketball,134906,Olena Mykolaivna Zhyrko (-Marenchikova),F,28.0,180.0,NaN,Ukraine,UKR,1996 Summer,Summer,Atlanta,NaN
Basketball Women's Basketball,135105,Zuzana irkov,F,20.0,175.0,67.0,Slovakia,SVK,2000 Summer,Summer,Sydney,NaN
Basketball Men's Basketball,135401,Eurelijus ukauskas,M,22.0,218.0,115.0,Lithuania,LTU,1996 Summer,Summer,Atlanta,Bronze
Basketball Men's Basketball,135401,Eurelijus ukauskas,M,27.0,218.0,115.0,Lithuania,LTU,2000 Summer,Summer,Sydney,Bronze
Basketball Men's Basketball,135402,Mindaugas ukauskas,M,20.0,201.0,100.0,Lithuania,LTU,1996 Summer,Summer,Atlanta,Bronze

In [76]:
mylist = [10, 20, 30, 40, 50, 60, 70]

mylist[2:6]    # slice

[30, 40, 50, 60]

In [78]:
mylist[slice(2,6)]

[30, 40, 50, 60]

In [79]:
df = pd.read_csv('olympic_athlete_events.csv')
df = df.set_index(['Year', 'Sport', 'Event'])
df.head()

,,,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Year,Sport,Event,,,,,,,,,,,,
1992,Basketball,Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
2012,Judo,Judo Men's Extra-Lightweight,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,Summer,London,NaN
1920,Football,Football Men's Football,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Summer,Antwerpen,NaN
1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Gold
1988,Speed Skating,Speed Skating Women's 500 metres,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Winter,Calgary,NaN

In [80]:
df.loc[1992]

                                                                    ID  \
Sport                 Event
Basketball            Basketball Men's Basketball                    1
Speed Skating         Speed Skating Women's 500 metres               5
                      Speed Skating Women's 1,000 metres             5
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres       6
                      Cross Country Skiing Men's 50 kilometres       6
...                                                                ...
Synchronized Swimming Synchronized Swimming Women's Duet        135514
Volleyball            Volleyball Men's Volleyball               135523
Athletics             Athletics Women's 800 metres              135531
Fencing               Fencing Men's epee, Team                  135537
Rowing                Rowing Men's Double Sculls                135545

                                                                                                Name  \
Sport                 Event
Basketball            Basketball Men's Basketball                                          A Dijiang
Speed Skating         Speed Skating Women's 500 metres                      Christine Jacoba Aaftink
                      Speed Skating Women's 1,000 metres                    Christine Jacoba Aaftink
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres                       Per Knut Aaland
                      Cross Country Skiing Men's 50 kilometres                       Per Knut Aaland
...                                                                                              ...
Synchronized Swimming Synchronized Swimming Women's Duet                                Tamara Zwart
Volleyball            Volleyball Men's Volleyball                     Ronald Ferdinand "Ron" Zwerver
Athletics             Athletics Women's 800 metres              Sabine Beate Zwiener (-Jauchstetter)
Fencing               Fencing Men's epee, Team                            Sawomir Andrzej Zwierzyski
Rowing                Rowing Men's Double Sculls                                     Henk Jan Zwolle

                                                               Sex   Age  \
Sport                 Event
Basketball            Basketball Men's Basketball                M  24.0
Speed Skating         Speed Skating Women's 500 metres           F  25.0
                      Speed Skating Women's 1,000 metres         F  25.0
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres   M  31.0
                      Cross Country Skiing Men's 50 kilometres   M  31.0
...                                                             ..   ...
Synchronized Swimming Synchronized Swimming Women's Duet         F  17.0
Volleyball            Volleyball Men's Volleyball                M  25.0
Athletics             Athletics Women's 800 metres               F  24.0
Fencing               Fencing Men's epee, Team                   M  25.0
Rowing                Rowing Men's Double Sculls                 M  27.0

                                                                Height  \
Sport                 Event
Basketball            Basketball Men's Basketball                180.0
Speed Skating         Speed Skating Women's 500 metres           185.0
                      Speed Skating Women's 1,000 metres         185.0
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres   188.0
                      Cross Country Skiing Men's 50 kilometres   188.0
...                                                                ...
Synchronized Swimming Synchronized Swimming Women's Duet         167.0
Volleyball            Volleyball Men's Volleyball                200.0
Athletics             Athletics Women's 800 metres               172.0
Fencing               Fencing Men's epee, Team                   175.0
Rowing                Rowing Men's Double Sculls                 197.0

                                                                Weight  \
Sport                 Event
Basketball            Basketball Men's Basketball                 80.0
Speed Skating         Speed Skating Women's 500 metres            82.0
                      Speed Skating Women's 1,000 metres          82.0
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres    75.0
                      Cross Country Skiing Men's 50 kilometres    75.0
...                                                                ...
Synchronized Swimming Synchronized Swimming Women's Duet          57.0
Volleyball            Volleyball Men's Volleyball                 93.0
Athletics             Athletics Women's 800 metres                52.0
Fencing               Fencing Men's epee, Team                    72.0
Rowing                Rowing Men's Double Sculls                  93.0

                                                                         Team  \
Sport                 Event
Basketball            Basketball Men's Basketball                       China
Speed Skating         Speed Skating Women's 500 metres            Netherlands
                      Speed Skating Women's 1,000 metres          Netherlands
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres  United States
                      Cross Country Skiing Men's 50 kilometres  United States
...                                                                       ...
Synchronized Swimming Synchronized Swimming Women's Duet          Netherlands
Volleyball            Volleyball Men's Volleyball                 Netherlands
Athletics             Athletics Women's 800 metres                    Germany
Fencing               Fencing Men's epee, Team                         Poland
Rowing                Rowing Men's Double Sculls                  Netherlands

                                                                NOC  \
Sport                 Event
Basketball            Basketball Men's Basketball               CHN
Speed Skating         Speed Skating Women's 500 metres          NED
                      Speed Skating Women's 1,000 metres        NED
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres  USA
                      Cross Country Skiing Men's 50 kilometres  USA
...                                                             ...
Synchronized Swimming Synchronized Swimming Women's Duet        NED
Volleyball            Volleyball Men's Volleyball               NED
Athletics             Athletics Women's 800 metres              GER
Fencing               Fencing Men's epee, Team                  POL
Rowing                Rowing Men's Double Sculls                NED

                                                                      Games  \
Sport                 Event
Basketball            Basketball Men's Basketball               1992 Summer
Speed Skating         Speed Skating Women's 500 metres          1992 Winter
                      Speed Skating Women's 1,000 metres        1992 Winter
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres  1992 Winter
                      Cross Country Skiing Men's 50 kilometres  1992 Winter
...                                                                     ...
Synchronized Swimming Synchronized Swimming Women's Duet        1992 Summer
Volleyball            Volleyball Men's Volleyball               1992 Summer
Athletics             Athletics Women's 800 metres              1992 Summer
Fencing               Fencing Men's epee, Team                  1992 Summer
Rowing                Rowing Men's Double Sculls                1992 Summer

                                                                Season  \
Sport                 Event
Basketball            Basketball Men's Basketball               Summer
Speed Skating         Speed Skating Women's 500 metres          Winter
                      Speed Skating Women's 1,000 metres        Winter
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres  Winter
                      Cross Country Skiing Men's 50 kilometres  Winter
...                                                                ...
Synchronized Swimming Synchronized Swimming Women's Duet        Summer
Volleyball            Volleyball Men's Volleyball               Summer
Athletics             Athletics Women's 800 metres              Summer
Fencing               Fencing Men's epee, Team                  Summer
Rowing                Rowing Men's Double Sculls                Summer

                                                                       City  \
Sport                 Event
Basketball            Basketball Men's Basketball                 Barcelona
Speed Skating         Speed Skating Women's 500 metres          Albertville
                      Speed Skating Women's 1,000 metres        Albertville
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres  Albertville
                      Cross Country Skiing Men's 50 kilometres  Albertville
...                                                                     ...
Synchronized Swimming Synchronized Swimming Women's Duet          Barcelona
Volleyball            Volleyball Men's Volleyball                 Barcelona
Athletics             Athletics Women's 800 metres                Barcelona
Fencing               Fencing Men's epee, Team                    Barcelona
Rowing                Rowing Men's Double Sculls                  Barcelona

                                                                 Medal
Sport                 Event
Basketball            Basketball Men's Basketball                  NaN
Speed Skating         Speed Skating Women's 500 metres             NaN
                      Speed Skating Women's 1,000 metres           NaN
Cross Country Skiing  Cross Country Skiing Men's 10 kilometres     NaN
                      Cross Country Skiing Men's 50 kilometres     NaN
...                                                                ...
Synchronized Swimming Synchronized Swimming Women's Duet           NaN
Volleyball            Volleyball Men's Volleyball               Silver
Athletics             Athletics Women's 800 metres                 NaN
Fencing               Fencing Men's epee, Team                     NaN
Rowing                Rowing Men's Double Sculls                Bronze

[16413 rows x 12 columns]

# Sorting

When we sort a series, we can sort by:

- `sort_index` (by the index)
- `sort_values` (by the values)

  The same is true in a data frame -- we just need to indicate which column to use for the values.

In [82]:
taxi_df = pd.read_csv('taxi.csv')
taxi_df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [84]:
taxi_df = taxi_df.sort_values('VendorID')
taxi_df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
4999,1,2015-06-02 11:33:23,2015-06-02 11:40:19,2,1.20,-73.951424,40.777779,1,N,-73.971481,40.786201,1,7.0,0.0,0.5,1.55,0.00,0.3,9.35
5513,1,2015-06-04 15:16:36,2015-06-04 15:26:43,1,1.40,-74.003853,40.725670,1,Y,-73.989853,40.734646,1,8.5,0.0,0.5,1.00,0.00,0.3,10.30
5512,1,2015-06-04 15:16:35,2015-06-04 15:20:36,1,0.90,0.000000,0.000000,1,N,0.000000,0.000000,2,5.5,0.0,0.5,0.00,0.00,0.3,6.30
5510,1,2015-06-04 15:16:33,2015-06-04 15:33:31,1,1.70,-73.945778,40.773640,1,N,-73.969780,40.786469,1,11.5,0.0,0.5,1.70,0.00,0.3,14.00
5508,1,2015-06-04 15:17:26,2015-06-04 15:31:38,2,1.80,-73.958527,40.775547,1,N,-73.965042,40.791878,2,11.5,0.0,0.5,0.00,0.00,0.3,12.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5790,2,2015-06-04 15:18:02,2015-06-04 15:36:34,1,1.81,-73.953911,40.787788,1,N,-73.961517,40.769180,2,12.5,0.0,0.5,0.00,0.00,0.3,13.30
2053,2,2015-06-02 11:30:41,2015-06-02 11:42:43,1,0.70,-73.961060,40.756413,1,N,-73.970375,40.762348,2,8.5,0.0,0.5,0.00,0.00,0.3,9.30
5788,2,2015-06-04 15:18:01,2015-06-04 15:35:58,1,2.70,-73.978592,40.750046,1,N,-73.998337,40.717552,2,13.0,0.0,0.5,0.00,0.00,0.3,13.80
5786,2,2015-06-04 15:17:59,2015-06-04 16:09:44,5,15.75,-73.787354,40.664379,2,N,-73.989464,40.736252,1,52.0,0.0,0.5,0.00,5.54,0.3,58.34
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.00,0.3,17.80

In [86]:
taxi_df = taxi_df.sort_index()
taxi_df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [88]:
# sort by more than one value?

taxi_df.sort_values(['VendorID', 'passenger_count'])

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
5097,1,2015-06-04 15:15:45,2015-06-04 15:32:10,0,1.30,-73.953949,40.778915,1,N,-73.970337,40.788288,1,11.0,0.0,0.5,2.95,0.00,0.3,14.75
8313,1,2015-06-01 00:03:42,2015-06-01 00:22:09,0,7.90,-73.885246,40.773014,1,N,-73.976089,40.741604,1,23.5,0.5,0.5,6.05,5.54,0.3,36.39
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.00,0.3,10.30
5,1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.944641,40.779465,1,N,-73.961365,40.771561,1,8.0,0.0,0.5,1.75,0.00,0.3,10.55
6,1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992867,40.748211,1,N,-73.969772,40.748459,1,12.5,0.0,0.5,3.00,0.00,0.3,16.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9953,2,2015-06-01 00:13:42,2015-06-01 00:21:01,6,1.07,-73.994072,40.759239,1,N,-73.976021,40.751888,1,7.0,0.5,0.5,2.49,0.00,0.3,10.79
9961,2,2015-06-01 00:13:05,2015-06-01 00:22:38,6,2.72,-73.923241,40.767677,1,N,-73.956253,40.747513,1,10.5,0.5,0.5,2.36,0.00,0.3,14.16
9963,2,2015-06-01 00:13:07,2015-06-01 00:21:14,6,1.52,-73.972778,40.750256,1,N,-73.989075,40.762695,2,8.0,0.5,0.5,0.00,0.00,0.3,9.30
9989,2,2015-06-01 00:13:41,2015-06-01 00:17:44,6,1.34,-74.005898,40.735851,1,N,-73.991318,40.748177,1,6.0,0.5,0.5,1.46,0.00,0.3,8.76
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.00,0.3,7.80

In [89]:
# here, we are sorting in increasing order
# what if we want in decreasing?

taxi_df.sort_values(['VendorID', 'passenger_count'], ascending=False)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
30,2,2015-06-02 11:19:55,2015-06-02 11:32:57,6,0.81,-73.999336,40.754444,1,N,-73.996078,40.748554,2,8.5,0.0,0.5,0.00,0.00,0.3,9.30
62,2,2015-06-02 11:20:17,2015-06-02 11:24:33,6,0.51,-73.953720,40.775059,1,N,-73.960892,40.774948,2,5.0,0.0,0.5,0.00,0.00,0.3,5.80
71,2,2015-06-02 11:20:25,2015-06-02 11:35:44,6,0.88,-73.994125,40.751011,1,N,-73.985313,40.758541,1,10.0,0.0,0.5,3.24,0.00,0.3,14.04
146,2,2015-06-02 11:21:23,2015-06-02 11:33:09,6,1.21,-73.998741,40.744953,1,N,-73.980057,40.736820,1,9.0,0.0,0.5,2.45,0.00,0.3,12.25
188,2,2015-06-02 11:21:52,2015-06-02 11:36:17,6,1.84,-73.971909,40.794464,1,N,-73.963913,40.776718,1,11.0,0.0,0.5,2.36,0.00,0.3,14.16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.00,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.00,0.3,20.30
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.00,0.3,26.75
5097,1,2015-06-04 15:15:45,2015-06-04 15:32:10,0,1.30,-73.953949,40.778915,1,N,-73.970337,40.788288,1,11.0,0.0,0.5,2.95,0.00,0.3,14.75
8313,1,2015-06-01 00:03:42,2015-06-01 00:22:09,0,7.90,-73.885246,40.773014,1,N,-73.976089,40.741604,1,23.5,0.5,0.5,6.05,5.54,0.3,36.39

In [90]:
# what if I want VendorID in ascending order, but passenger_count in descending?
taxi_df.sort_values(['VendorID', 'passenger_count'], ascending=[True, False])

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
7711,1,2015-06-06 16:52:59,2015-06-06 17:06:04,5,3.50,-73.951843,40.793392,1,N,-73.991821,40.770599,2,13.0,0.0,0.5,0.00,0.00,0.3,13.80
7820,1,2015-06-04 15:22:54,2015-06-04 15:53:23,5,3.00,-73.988106,40.748238,1,N,-73.961945,40.779510,2,19.5,0.0,0.5,0.00,0.00,0.3,20.30
9889,1,2015-06-01 00:13:13,2015-06-01 00:35:56,5,8.30,-73.949165,40.749912,1,N,-73.979492,40.665749,2,26.0,0.5,0.5,0.00,0.00,0.3,27.30
7,1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075,40.769253,1,N,-73.986710,40.761307,1,52.5,0.0,0.5,15.00,5.54,0.3,73.84
135,1,2015-06-02 11:21:13,2015-06-02 11:42:13,4,6.20,-73.989975,40.750702,1,N,-74.014153,40.712116,2,22.5,0.0,0.5,0.00,0.00,0.3,23.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9986,2,2015-06-01 00:13:34,2015-06-01 00:30:49,1,5.55,-73.979256,40.761784,1,N,-73.938850,40.818211,1,18.0,0.5,0.5,2.05,0.00,0.3,21.35
9990,2,2015-06-01 00:13:42,2015-06-01 00:34:32,1,6.07,-73.979309,40.723488,1,N,-73.958405,40.673611,1,20.0,0.5,0.5,5.32,0.00,0.3,26.62
9991,2,2015-06-01 00:13:43,2015-06-01 00:21:49,1,1.48,-73.988739,40.756950,1,N,-73.976860,40.743309,2,8.0,0.5,0.5,0.00,0.00,0.3,9.30
9992,2,2015-06-01 00:13:45,2015-06-01 00:36:43,1,6.37,-74.006752,40.744141,1,N,-73.922806,40.764030,2,22.0,0.5,0.5,0.00,0.00,0.3,23.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.00,0.3,22.30

In [91]:
df.head()

,,,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Year,Sport,Event,,,,,,,,,,,,
1992,Basketball,Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
2012,Judo,Judo Men's Extra-Lightweight,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,Summer,London,NaN
1920,Football,Football Men's Football,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Summer,Antwerpen,NaN
1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Gold
1988,Speed Skating,Speed Skating Women's 500 metres,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Winter,Calgary,NaN

In [93]:
df = df.sort_index()

In [94]:
%timeit df.loc[1992, 'Height'].mean()

1.16 ms  9.24 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [95]:
%timeit df.loc[1992].loc[:, 'Height'].mean()

784 s  6.57 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [96]:
%timeit df.loc[1992]['Height'].mean()

717 s  8.19 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [6]:
df.shape

(271116, 12)

# How many rows are in my data frame?

In [7]:
# get it from shape
%timeit df.shape[0]

775 ns  16.9 ns per loop (mean  std. dev. of 7 runs, 1,000,000 loops each)

In [9]:
%timeit len(df)

593 ns  25.3 ns per loop (mean  std. dev. of 7 runs, 1,000,000 loops each)

In [10]:
# how many columns
len(df.columns)

12

In [11]:
# a third option

%timeit len(df.index)

520 ns  17.1 ns per loop (mean  std. dev. of 7 runs, 1,000,000 loops each)

In [14]:
# len(df.index)
df.size

3253392

In [18]:
for one_column in df.columns:
    print('\n\n', one_column)
    print(df[one_column].head())

 ID
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         1
2012  Judo           Judo Men's Extra-Lightweight        2
1920  Football       Football Men's Football             3
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         4
1988  Speed Skating  Speed Skating Women's 500 metres    5
Name: ID, dtype: int64


 Name
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball                        A Dijiang
2012  Judo           Judo Men's Extra-Lightweight                        A Lamusi
1920  Football       Football Men's Football                  Gunnar Nielsen Aaby
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War             Edgar Lindenau Aabye
1988  Speed Skating  Speed Skating Women's 500 metres    Christine Jacoba Aaftink
Name: Name, dtype: object


 Sex
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         M
2012  Judo           Judo Men's Extra-Lightweight        M
1920  Football       Football Men's Football             M
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         M
1988  Speed Skating  Speed Skating Women's 500 metres    F
Name: Sex, dtype: object


 Age
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         24.0
2012  Judo           Judo Men's Extra-Lightweight        23.0
1920  Football       Football Men's Football             24.0
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         34.0
1988  Speed Skating  Speed Skating Women's 500 metres    21.0
Name: Age, dtype: float64


 Height
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         180.0
2012  Judo           Judo Men's Extra-Lightweight        170.0
1920  Football       Football Men's Football               NaN
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War           NaN
1988  Speed Skating  Speed Skating Women's 500 metres    185.0
Name: Height, dtype: float64


 Weight
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         80.0
2012  Judo           Judo Men's Extra-Lightweight        60.0
1920  Football       Football Men's Football              NaN
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War          NaN
1988  Speed Skating  Speed Skating Women's 500 metres    82.0
Name: Weight, dtype: float64


 Team
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball                  China
2012  Judo           Judo Men's Extra-Lightweight                 China
1920  Football       Football Men's Football                    Denmark
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         Denmark/Sweden
1988  Speed Skating  Speed Skating Women's 500 metres       Netherlands
Name: Team, dtype: object


 NOC
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         CHN
2012  Judo           Judo Men's Extra-Lightweight        CHN
1920  Football       Football Men's Football             DEN
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         DEN
1988  Speed Skating  Speed Skating Women's 500 metres    NED
Name: NOC, dtype: object


 Games
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         1992 Summer
2012  Judo           Judo Men's Extra-Lightweight        2012 Summer
1920  Football       Football Men's Football             1920 Summer
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         1900 Summer
1988  Speed Skating  Speed Skating Women's 500 metres    1988 Winter
Name: Games, dtype: object


 Season
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         Summer
2012  Judo           Judo Men's Extra-Lightweight        Summer
1920  Football       Football Men's Football             Summer
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         Summer
1988  Speed Skating  Speed Skating Women's 500 metres    Winter
Name: Season, dtype: object


 City
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball         Barcelona
2012  Judo           Judo Men's Extra-Lightweight           London
1920  Football       Football Men's Football             Antwerpen
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War             Paris
1988  Speed Skating  Speed Skating Women's 500 metres      Calgary
Name: City, dtype: object


 Medal
Year  Sport          Event
1992  Basketball     Basketball Men's Basketball          NaN
2012  Judo           Judo Men's Extra-Lightweight         NaN
1920  Football       Football Men's Football              NaN
1900  Tug-Of-War     Tug-Of-War Men's Tug-Of-War         Gold
1988  Speed Skating  Speed Skating Women's 500 metres     NaN
Name: Medal, dtype: object

In [19]:
df.head()

,,,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Year,Sport,Event,,,,,,,,,,,,
1992,Basketball,Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
2012,Judo,Judo Men's Extra-Lightweight,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,Summer,London,NaN
1920,Football,Football Men's Football,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Summer,Antwerpen,NaN
1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Gold
1988,Speed Skating,Speed Skating Women's 500 metres,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Winter,Calgary,NaN

In [20]:
df.count()

ID        271116
Name      271116
Sex       271116
Age       261642
Height    210945
Weight    208241
Team      271116
NOC       271116
Games     271116
Season    271116
City      271116
Medal      39783
dtype: int64

In [21]:
# how many numbers are NaN?

len(df.index) - df.count()

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Season         0
City           0
Medal     231333
dtype: int64

In [22]:
# my preference
df.isna().sum()

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Season         0
City           0
Medal     231333
dtype: int64

In [23]:
# Grouping

df = pd.read_csv('taxi.csv',
                usecols=['passenger_count', 'trip_distance',
                        'total_amount', 'VendorID', 'tip_amount'])

In [24]:
df.head()

   VendorID  passenger_count  trip_distance  tip_amount  total_amount
0         2                1           1.63        0.00         17.80
1         2                1           0.46        1.00          8.30
2         2                1           0.87        2.20         11.00
3         2                1           2.13        2.86         17.16
4         1                1           1.40        0.00         10.30

In [27]:
# how far did people go, on average, with one passenger?
df.loc[df['passenger_count'] == 1, 'trip_distance'].mean()

3.0923380047176354

In [28]:
# how far did people go, on average, with 2 passengers?
df.loc[df['passenger_count'] == 2, 'trip_distance'].mean()

3.3843869002284848

In [29]:
# how far did people go, on average, with 3 passengers?
df.loc[df['passenger_count'] == 3, 'trip_distance'].mean()

3.3423891625615765

# Grouping means:

- I have a categorical column
- I have a numeric column
- I have an aggregation method

I want to run the method on the numeric column for each value of the categorical

In [30]:
df.groupby('passenger_count')['trip_distance'].mean()

passenger_count
0    4.600000
1    3.092338
2    3.384387
3    3.342389
4    3.628901
5    3.182712
6    3.170976
Name: trip_distance, dtype: float64

In [31]:
df.groupby('passenger_count')

In [32]:
df.groupby('passenger_count')['trip_distance']

In [33]:
df.groupby('passenger_count')['trip_distance'].describe()

                  count      mean       std  min    25%    50%     75%    max
passenger_count
0                   2.0  4.600000  4.666905  1.3  2.950  4.600  6.2500   7.90
1                7207.0  3.092338  4.020187  0.0  0.990  1.630  3.2000  64.60
2                1313.0  3.384387  4.242826  0.0  1.060  1.800  3.6000  29.78
3                 406.0  3.342389  3.822041  0.0  1.070  1.700  3.7400  21.80
4                 182.0  3.628901  4.351369  0.0  1.215  2.000  3.9800  22.67
5                 520.0  3.182712  3.969468  0.0  0.970  1.675  3.1775  24.97
6                 369.0  3.170976  3.759807  0.0  0.990  1.670  3.3400  23.81

# Exercise: Olympic grouping

1. Read all of the Olympic data into a data frame. Don't set an index.
2. Find the mean height for each sex.
3. Find the max height for each sport. Which 5 sports have the tallest athletes?
4. What 5 sports have the youngest participants, on average?
5. In which year were there the participants, on average, the heaviest?

In [34]:
df = pd.read_csv('olympic_athlete_events.csv')
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [35]:
# 2. Find the mean height for each sex.

df.groupby('Sex')['Height'].mean()

Sex
F    167.839740
M    178.858463
Name: Height, dtype: float64

In [39]:
# 3. Find the max height for each sport. Which 5 sports have the tallest athletes?

df.groupby('Sport')['Height'].max().sort_values(ascending=False).head(5)

Sport
Basketball    226.0
Volleyball    219.0
Handball      214.0
Wrestling     214.0
Judo          213.0
Name: Height, dtype: float64

In [42]:
# 4. What 5 sports have the youngest participants, on average?

df.groupby('Sport')['Age'].mean().sort_values().head(5)

Sport
Rhythmic Gymnastics      18.737082
Swimming                 20.566803
Figure Skating           22.232190
Synchronized Swimming    22.366851
Diving                   22.481441
Name: Age, dtype: float64

In [44]:
# 5. In which year were there the participants, on average, the heaviest?

df.groupby('Year')['Weight'].mean().sort_values(ascending=False).head()

Year
1906    75.917073
1908    75.386128
1900    74.556962
1912    73.117450
1920    73.106157
Name: Weight, dtype: float64

In [45]:
# more than one numeric column

df.groupby('Year')[['Height', 'Weight']].mean()

          Height     Weight
Year
1896  172.739130  71.387755
1900  176.637931  74.556962
1904  175.788732  72.197279
1906  178.206226  75.917073
1908  177.543158  75.386128
1912  177.447989  73.117450
1920  175.752282  73.106157
1924  174.963039  71.678261
1928  175.162051  70.987465
1932  174.220115  70.544545
1936  175.723993  71.505572
1948  176.172797  71.614248
1952  174.138940  70.034522
1956  173.900968  70.388433
1960  173.141286  69.315195
1964  173.448574  69.710271
1968  173.945865  69.596896
1972  174.565363  70.002506
1976  174.920528  70.129375
1980  175.527488  70.717600
1984  175.540855  70.243286
1988  175.745252  70.485319
1992  176.174649  71.137975
1994  175.169862  71.062100
1996  175.895121  70.903281
1998  174.581369  70.943734
2000  176.089721  71.119046
2002  174.702451  71.197070
2004  175.972850  71.280695
2006  174.623172  70.519354
2008  176.211062  71.397679
2010  174.918182  70.740863
2012  176.262469  71.319586
2014  174.816670  70.760111
2016  176.034266  70.988637

In [46]:
df.groupby('Year')['Height'].agg(['mean', 'std'])

            mean        std
Year
1896  172.739130  11.152349
1900  176.637931   8.386735
1904  175.788732   7.875653
1906  178.206226   7.284956
1908  177.543158   7.479630
1912  177.447989   7.228445
1920  175.752282   7.786053
1924  174.963039   7.906615
1928  175.162051   8.198287
1932  174.220115   8.464653
1936  175.723993   8.609457
1948  176.172797   8.197639
1952  174.138940   9.595566
1956  173.900968   9.488475
1960  173.141286   9.255978
1964  173.448574   9.402389
1968  173.945865   9.524800
1972  174.565363   9.906350
1976  174.920528  10.218080
1980  175.527488  10.972277
1984  175.540855  10.517976
1988  175.745252  10.835290
1992  176.174649  10.665646
1994  175.169862   8.434396
1996  175.895121  11.621747
1998  174.581369   8.819673
2000  176.089721  11.372886
2002  174.702451   8.823774
2004  175.972850  11.547017
2006  174.623172   8.826630
2008  176.211062  11.469046
2010  174.918182   8.942652
2012  176.262469  11.450776
2014  174.816670   9.011575
2016  176.034266  11.440259

In [47]:
df.groupby('Year')['Height'].agg([np.mean, np.std])

            mean        std
Year
1896  172.739130  11.152349
1900  176.637931   8.386735
1904  175.788732   7.875653
1906  178.206226   7.284956
1908  177.543158   7.479630
1912  177.447989   7.228445
1920  175.752282   7.786053
1924  174.963039   7.906615
1928  175.162051   8.198287
1932  174.220115   8.464653
1936  175.723993   8.609457
1948  176.172797   8.197639
1952  174.138940   9.595566
1956  173.900968   9.488475
1960  173.141286   9.255978
1964  173.448574   9.402389
1968  173.945865   9.524800
1972  174.565363   9.906350
1976  174.920528  10.218080
1980  175.527488  10.972277
1984  175.540855  10.517976
1988  175.745252  10.835290
1992  176.174649  10.665646
1994  175.169862   8.434396
1996  175.895121  11.621747
1998  174.581369   8.819673
2000  176.089721  11.372886
2002  174.702451   8.823774
2004  175.972850  11.547017
2006  174.623172   8.826630
2008  176.211062  11.469046
2010  174.918182   8.942652
2012  176.262469  11.450776
2014  174.816670   9.011575
2016  176.034266  11.440259

In [50]:
results = df.groupby('Year')[['Height', 'Weight']].agg([np.mean, np.std])
results.head()

          Height                Weight
            mean        std       mean        std
Year
1896  172.739130  11.152349  71.387755  13.819998
1900  176.637931   8.386735  74.556962  12.232520
1904  175.788732   7.875653  72.197279  14.017914
1906  178.206226   7.284956  75.917073  11.954384
1908  177.543158   7.479630  75.386128  12.757573

In [52]:
results[('Height', 'mean')]

Year
1896    172.739130
1900    176.637931
1904    175.788732
1906    178.206226
1908    177.543158
1912    177.447989
1920    175.752282
1924    174.963039
1928    175.162051
1932    174.220115
1936    175.723993
1948    176.172797
1952    174.138940
1956    173.900968
1960    173.141286
1964    173.448574
1968    173.945865
1972    174.565363
1976    174.920528
1980    175.527488
1984    175.540855
1988    175.745252
1992    176.174649
1994    175.169862
1996    175.895121
1998    174.581369
2000    176.089721
2002    174.702451
2004    175.972850
2006    174.623172
2008    176.211062
2010    174.918182
2012    176.262469
2014    174.816670
2016    176.034266
Name: (Height, mean), dtype: float64

In [55]:
results.xs('mean', level=1, axis='columns')

          Height     Weight
Year
1896  172.739130  71.387755
1900  176.637931  74.556962
1904  175.788732  72.197279
1906  178.206226  75.917073
1908  177.543158  75.386128
1912  177.447989  73.117450
1920  175.752282  73.106157
1924  174.963039  71.678261
1928  175.162051  70.987465
1932  174.220115  70.544545
1936  175.723993  71.505572
1948  176.172797  71.614248
1952  174.138940  70.034522
1956  173.900968  70.388433
1960  173.141286  69.315195
1964  173.448574  69.710271
1968  173.945865  69.596896
1972  174.565363  70.002506
1976  174.920528  70.129375
1980  175.527488  70.717600
1984  175.540855  70.243286
1988  175.745252  70.485319
1992  176.174649  71.137975
1994  175.169862  71.062100
1996  175.895121  70.903281
1998  174.581369  70.943734
2000  176.089721  71.119046
2002  174.702451  71.197070
2004  175.972850  71.280695
2006  174.623172  70.519354
2008  176.211062  71.397679
2010  174.918182  70.740863
2012  176.262469  71.319586
2014  174.816670  70.760111
2016  176.034266  70.988637

In [57]:
df.groupby(['Year', 'Sport'])['Height'].mean().head(20)

Year  Sport
1896  Athletics        174.875000
      Cycling                 NaN
      Fencing                 NaN
      Gymnastics       163.111111
      Shooting                NaN
      Swimming                NaN
      Tennis                  NaN
      Weightlifting    178.333333
      Wrestling        173.500000
1900  Archery                 NaN
      Athletics        178.578947
      Basque Pelota           NaN
      Cricket                 NaN
      Croquet                 NaN
      Cycling          172.000000
      Equestrianism    166.000000
      Fencing          170.500000
      Football                NaN
      Golf             175.333333
      Gymnastics       166.750000
Name: Height, dtype: float64

In [58]:
df.groupby(['Year', 'Sport'])[['Height']].mean().head(20)

                        Height
Year Sport
1896 Athletics      174.875000
     Cycling               NaN
     Fencing               NaN
     Gymnastics     163.111111
     Shooting              NaN
     Swimming              NaN
     Tennis                NaN
     Weightlifting  178.333333
     Wrestling      173.500000
1900 Archery               NaN
     Athletics      178.578947
     Basque Pelota         NaN
     Cricket               NaN
     Croquet               NaN
     Cycling        172.000000
     Equestrianism  166.000000
     Fencing        170.500000
     Football              NaN
     Golf           175.333333
     Gymnastics     166.750000